Revit 2024 API
IDuctFittingAndAccessoryPressureDropServer Members
The IDuctFittingAndAccessoryPressureDropServer type exposes the following members.
Methods
Name | Description
Calculate
 Calculate the duct fitting and duct accessory coefficient.
GetDataSchema
 Obtains the schema of the ESEntity.
GetDescription
 Implement this method to return a description of the server.
 (Inherited from IExternalServer.)
GetName
 Implement this method to return the name of the server.
 (Inherited from IExternalServer.)
GetServerId
 Implement this method to return the id of the server.
 (Inherited from IExternalServer.)
GetServiceId
 Implement this method to return the id of the service.
 (Inherited from IExternalServer.)
GetVendorId
 Implement this method to return the id of the vendor of the server.
 (Inherited from IExternalServer.)
IsApplicable
 Check if the server is applicable for the duct fitting or duct accessory.
See Also
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace